#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Deprecated attribute

  on main.tf line 88, in resource "cloudflare_record" "ipv4":
  88:   value   = sensitive(chomp(data.http.ipv4.body))

The attribute "body" is deprecated. Refer to the provider documentation for
details.
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.http.ipv4: Reading...
data.sops_file.cloudflare_secrets: Reading...
data.sops_file.cloudflare_secrets: Read complete after 0s [id=-]
data.cloudflare_zones.domain: Reading...
data.http.ipv4: Read complete after 0s [id=http://ipv4.icanhazip.com]
data.cloudflare_zones.domain: Read complete after 1s [id=67a758d0a7c24d0b8db479ee2c1ab808]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.ipv4 will be created
  + resource "cloudflare_record" "ipv4" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "ipv4"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "A"
      + value           = (sensitive)
      + zone_id         = (sensitive)
    }

  # cloudflare_record.root will be created
  + resource "cloudflare_record" "root" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = (sensitive)
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = (sensitive)
      + zone_id         = (sensitive)
    }

  # cloudflare_zone_settings_override.cloudflare_settings will be created
  + resource "cloudflare_zone_settings_override" "cloudflare_settings" {
      + id                       = (known after apply)
      + initial_settings         = (known after apply)
      + initial_settings_read_at = (known after apply)
      + readonly_settings        = (known after apply)
      + zone_id                  = (sensitive)
      + zone_status              = (known after apply)
      + zone_type                = (known after apply)

      + settings {
          + always_online               = "off"
          + always_use_https            = "on"
          + automatic_https_rewrites    = "on"
          + binary_ast                  = (known after apply)
          + brotli                      = "on"
          + browser_cache_ttl           = (known after apply)
          + browser_check               = "on"
          + cache_level                 = (known after apply)
          + challenge_ttl               = 1800
          + ciphers                     = (known after apply)
          + cname_flattening            = (known after apply)
          + development_mode            = "off"
          + early_hints                 = (known after apply)
          + email_obfuscation           = "on"
          + filter_logs_to_cloudflare   = (known after apply)
          + h2_prioritization           = (known after apply)
          + hotlink_protection          = "off"
          + http2                       = (known after apply)
          + http3                       = "on"
          + image_resizing              = (known after apply)
          + ip_geolocation              = "on"
          + ipv6                        = "on"
          + log_to_cloudflare           = (known after apply)
          + max_upload                  = (known after apply)
          + min_tls_version             = "1.0"
          + mirage                      = (known after apply)
          + opportunistic_encryption    = "on"
          + opportunistic_onion         = "on"
          + orange_to_orange            = (known after apply)
          + origin_error_page_pass_thru = (known after apply)
          + origin_max_http_version     = (known after apply)
          + polish                      = (known after apply)
          + prefetch_preload            = (known after apply)
          + privacy_pass                = "on"
          + proxy_read_timeout          = (known after apply)
          + pseudo_ipv4                 = "off"
          + response_buffering          = (known after apply)
          + rocket_loader               = "on"
          + security_level              = "medium"
          + server_side_exclude         = "on"
          + sort_query_string_for_cache = (known after apply)
          + ssl                         = "strict"
          + tls_1_2_only                = (known after apply)
          + tls_1_3                     = "zrt"
          + tls_client_auth             = (known after apply)
          + true_client_ip_header       = (known after apply)
          + universal_ssl               = "on"
          + visitor_ip                  = (known after apply)
          + waf                         = (known after apply)
          + webp                        = (known after apply)
          + websockets                  = "on"
          + zero_rtt                    = "on"

          + minify {
              + css  = "on"
              + html = "on"
              + js   = "on"
            }

          + mobile_redirect {
              + mobile_subdomain = (known after apply)
              + status           = (known after apply)
              + strip_uri        = (known after apply)
            }

          + security_header {
              + enabled            = false
              + include_subdomains = (known after apply)
              + max_age            = (known after apply)
              + nosniff            = (known after apply)
              + preload            = (known after apply)
            }
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Warning: Deprecated attribute

  on main.tf line 88, in resource "cloudflare_record" "ipv4":
  88:   value   = sensitive(chomp(data.http.ipv4.body))

The attribute "body" is deprecated. Refer to the provider documentation for
details.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @pepinillo-bot[bot], Action: `pull_request`, Working Directory: `provision/terraform/cloudflare`, Workflow: `Terraform`*